{
    "resourceType": "CodeSystem",
    "id": "us-core-sex-for-clinical-use",
    "url": "http://hl7.org/fhir/us/core/CodeSystem/us-core-sex-for-clinical-use",
    "name": "USCoreSexForClinicalUse",
    "title": "US Core Sex for Clinical Use",
    "status": "active",
    "experimental": false,
    "date": "2022-11-22",
    "description": "Codes that represent the sex characterization appropriate for the associated clinical context.",
    "caseSensitive": true,
    "content": "complete",
    "property": [
        {
            "code": "usage-note",
            "description": "Usage notes for the concept.",
            "type": "string"
        }
    ],
    "concept": [
        {
            "code": "female",
            "display": "Female sex for clinical use",
            "definition": "Available data indicates that diagnostics, analytics, and treatments should consider best practices associated with female reference populations."
        },
        {
            "code": "male",
            "display": "Male sex for clinical use",
            "definition": "Available data indicates that diagnostics, analytics, and treatments should consider best practices associated with male reference populations."
        },
        {
            "code": "specified",
            "display": "Specified sex for clinical use",
            "definition": "Available data indicates that diagnostics, analytics, and treatment best practices may be undefined or not aligned with sex-derived reference populations.  Additional information (usually, but not always, in the form of comments and/or observations) is available, but does not align with male sex for clinical use or female sex for clinical use.",
            "property": [
                {
                    "code": "usage-note",
                    "valueString": "Individuals or systems providing care should either use default behavior that is safe for both male and female populations, individually review treatment options with the patient, or carefully inspect comments and relevant observations before proceeding with treatment. Systems that are unable to review additional information that may be associated with an SFCU value may manage a SPECIFIED and an UNKNOWN value in the same way."
                }
            ]
        },
        {
            "code": "unknown",
            "display": "Unknown",
            "definition": "No information can be provided.",
            "property": [
                {
                    "code": "usage-note",
                    "valueString": "Systems that are unable to review additional information that may be associated with an SFCU value may manage a SPECIFIED and an UNKNOWN value in the same way."
                }
            ]
        }
    ]
}