{
  "layers": [
    {
      "n_parallel": 1, 
      "fused_tanh": 0, 
      "Nx": 3, 
      "Ny": 5, 
      "bottom": "data", 
      "has_batch_norm": 0, 
      "top": "c1", 
      "type": "convolution", 
      "C": 16, 
      "pad_l": 0, 
      "pad_b": 0, 
      "K": 1, 
      "blob_weights": 3, 
      "n_groups": 1, 
      "blob_biases": 1, 
      "pad_r": 0, 
      "pad_t": 0, 
      "pad_fill_mode": 0, 
      "fused_relu": 0, 
      "name": "c1", 
      "pad_value": 0, 
      "pad_mode": 0, 
      "weights": {}, 
      "has_biases": 1
    }, 
    {
      "name": "tanh1", 
      "bottom": "c1", 
      "top": "tanh1", 
      "beta": 0.6665999889373779, 
      "weights": {}, 
      "mode": 5, 
      "alpha": 1.71589994430542, 
      "type": "activation"
    }, 
    {
      "pad_fill_mode": 0, 
      "name": "mp1", 
      "bottom": "tanh1", 
      "type": "pool", 
      "top_shape_style": 0, 
      "pad_l": 0, 
      "avg_or_max": 1, 
      "size_x": 2, 
      "pad_mode": 2, 
      "average_count_exclude_padding": 1, 
      "weights": {}, 
      "size_y": 2, 
      "pad_b": 0, 
      "pad_r": 0, 
      "pad_t": 0, 
      "pad_value": 0, 
      "top": "mp1", 
      "stride_x": 2, 
      "stride_y": 2
    }, 
    {
      "n_parallel": 1, 
      "fused_tanh": 0, 
      "Nx": 5, 
      "Ny": 5, 
      "bottom": "mp1", 
      "has_batch_norm": 0, 
      "top": "c2", 
      "type": "convolution", 
      "C": 32, 
      "pad_l": 0, 
      "pad_b": 0, 
      "K": 16, 
      "blob_weights": 7, 
      "n_groups": 1, 
      "blob_biases": 5, 
      "pad_r": 0, 
      "pad_t": 0, 
      "pad_fill_mode": 0, 
      "fused_relu": 0, 
      "name": "c2", 
      "pad_value": 0, 
      "pad_mode": 0, 
      "weights": {}, 
      "has_biases": 1
    }, 
    {
      "name": "tanh2", 
      "bottom": "c2", 
      "top": "tanh2", 
      "beta": 0.6665999889373779, 
      "weights": {}, 
      "mode": 5, 
      "alpha": 1.71589994430542, 
      "type": "activation"
    }, 
    {
      "pad_fill_mode": 0, 
      "name": "mp2", 
      "bottom": "tanh2", 
      "type": "pool", 
      "top_shape_style": 0, 
      "pad_l": 0, 
      "avg_or_max": 1, 
      "size_x": 2, 
      "pad_mode": 2, 
      "average_count_exclude_padding": 1, 
      "weights": {}, 
      "size_y": 2, 
      "pad_b": 0, 
      "pad_r": 0, 
      "pad_t": 0, 
      "pad_value": 0, 
      "top": "mp2_gpu", 
      "stride_x": 2, 
      "stride_y": 2
    }, 
    {
      "dst_platform_id": 0, 
      "name": "mp2_context_transfer", 
      "bottom": "mp2_gpu", 
      "top": "mp2", 
      "src_platform_id": 0, 
      "weights": {}, 
      "dst_compute_path": 0, 
      "type": "context_transfer", 
      "src_compute_path": 0
    }, 
    {
      "axis_n": 3, 
      "axis_h": 0, 
      "name": "transpose", 
      "bottom": "mp2", 
      "top": "transpose", 
      "axis_k": 2, 
      "axis_seq": 4, 
      "weights": {}, 
      "axis_w": 1, 
      "type": "transpose"
    }, 
    {
      "name": "flatten", 
      "bottom": "transpose", 
      "top": "flatten", 
      "weights": {}, 
      "mode": 0, 
      "nd_axis": 0, 
      "type": "flatten", 
      "hint_fallback_from_metal": 1
    }, 
    {
      "has_prelu": 0, 
      "nC": 104, 
      "name": "mlp4", 
      "bottom": "flatten", 
      "has_tanh": 0, 
      "blob_biases": 9, 
      "nB": 256, 
      "blob_weights": 11, 
      "weights": {}, 
      "has_relu": 0, 
      "has_biases": 1, 
      "type": "inner_product", 
      "top": "mlp4", 
      "hint_fallback_from_metal": 1
    }, 
    {
      "name": "tanh3", 
      "bottom": "mlp4", 
      "top": "tanh3", 
      "beta": 0.6665999889373779, 
      "weights": {}, 
      "mode": 5, 
      "alpha": 1.71589994430542, 
      "type": "activation"
    }, 
    {
      "has_prelu": 0, 
      "nC": 11, 
      "name": "mlp5", 
      "bottom": "tanh3", 
      "has_tanh": 0, 
      "blob_biases": 13, 
      "nB": 104, 
      "blob_weights": 15, 
      "weights": {}, 
      "has_relu": 0, 
      "has_biases": 1, 
      "type": "inner_product", 
      "top": "mlp5", 
      "hint_fallback_from_metal": 1
    }, 
    {
      "C": 2, 
      "name": "softmax_output", 
      "bottom": "mlp5", 
      "top": "softmax_output", 
      "weights": {}, 
      "type": "softmax", 
      "hint_fallback_from_metal": 1
    }
  ], 
  "storage": "model.espresso.weights", 
  "properties": {
    "ane_compiler_batch": "1"
  }, 
  "format_version": 200
}