{
    "resourceType": "CarePlan",
    "id": "careplan-ulcer-example",
    "meta": {
        "extension": [
            {
                "url": "http://hl7.org/fhir/StructureDefinition/instance-name",
                "valueString": "Ulcer CarePlan Example"
            },
            {
                "url": "http://hl7.org/fhir/StructureDefinition/instance-description",
                "valueMarkdown": "This is an Ulcer CarePlan example for the *US Core CarePlan Profile*."
            }
        ],
        "profile": [
            "http://hl7.org/fhir/us/core/StructureDefinition/us-core-careplan"
        ]
    },
    "text": {
        "status": "additional",
        "div": "<div xmlns=\"http://www.w3.org/1999/xhtml\"><h1>Duodenal Ulcer CarePlan for Amy V. Shaw</h1><p>This CarePlan, identified as \"careplan-duodenal-ulcer-2025,\" is an active plan created on September 27, 2025, at 20:35:29Z for patient Amy V. Shaw to address her diagnosed duodenal ulcer. Managed by Dr. Ronald Bone, the plan is designed to manage symptoms, promote healing, and prevent complications associated with the duodenal ulcer. The plan was initiated on September 27, 2025, and includes the following goals and activities tailored to the patient’s condition.</p><h2>Goals</h2><ol><li><strong>Symptom Relief</strong>: Reduce epigastric pain and discomfort associated with the duodenal ulcer to a level of 2 or less on a 0-10 pain scale within 2 weeks.</li><li><strong>Ulcer Healing</strong>: Promote complete healing of the duodenal ulcer, as confirmed by follow-up endoscopy within 8 weeks.</li><li><strong>Prevent Complications</strong>: Avoid complications such as bleeding or perforation by adhering to medication and dietary recommendations.</li><li><strong>Lifestyle Modification</strong>: Support the patient in adopting dietary and lifestyle changes to minimize ulcer recurrence within 3 months.</li></ol><h2>Activities</h2><ol><li><strong>Medication Management</strong>:\n  <ul><li><strong>Proton Pump Inhibitor (PPI)</strong>: Prescribe omeprazole 40 mg daily for 8 weeks to reduce gastric acid and promote ulcer healing.</li><li><strong>Antibiotics (if H. pylori positive)</strong>: If Helicobacter pylori infection is confirmed, initiate a 14-day course of amoxicillin 1 g twice daily and clarithromycin 500 mg twice daily.</li><li><strong>Follow-up</strong>: Schedule a medication review in 4 weeks to assess adherence and side effects.</li></ul></li><li><strong>Dietary Modifications</strong>:\n  <ul><li><strong>Action</strong>: Consult with a dietitian to develop a meal plan avoiding spicy, acidic, and fatty foods. Encourage small, frequent meals to reduce gastric irritation.</li><li><strong>Details</strong>: Avoid caffeine, alcohol, and NSAIDs, which can exacerbate ulcer symptoms.</li><li><strong>Timeline</strong>: Implement dietary changes immediately, with a dietitian follow-up in 2 weeks.</li></ul></li><li><strong>Patient Education</strong>:\n  <ul><li><strong>Action</strong>: Provide educational materials on duodenal ulcer management, including the importance of medication adherence and lifestyle changes.</li><li><strong>Details</strong>: Discuss stress management techniques, as stress may exacerbate symptoms.</li><li><strong>Timeline</strong>: Conduct an education session within 1 week, with reinforcement at follow-up visits.</li></ul></li><li><strong>Monitoring and Follow-up</strong>:\n  <ul><li><strong>Action</strong>: Schedule a follow-up appointment in 4 weeks to assess symptom improvement and order a repeat endoscopy in 8 weeks to confirm ulcer healing.</li><li><strong>Details</strong>: Monitor for signs of complications (e.g., severe abdominal pain, vomiting, or black stools) and instruct the patient to seek immediate care if these occur.</li><li><strong>Timeline</strong>: Ongoing monitoring with appointments at 4 and 8 weeks.</li></ul></li><li><strong>Lifestyle Support</strong>:\n  <ul><li><strong>Action</strong>: Recommend smoking cessation (if applicable) and stress reduction techniques, such as mindfulness or yoga.</li><li><strong>Details</strong>: Refer to a smoking cessation program and provide resources for stress management.</li><li><strong>Timeline</strong>: Initiate within 1 week, with progress review in 4 weeks.</li></ul></li></ol></div>"
    },
    "status": "active",
    "intent": "plan",
    "category": [
        {
            "coding": [
                {
                    "system": "http://snomed.info/sct",
                    "code": "734163000",
                    "display": "Care Plan"
                }
            ]
        }
    ],
    "subject": {
        "reference": "Patient/example",
        "display": "Amy V. Shaw"
    },
    "period": {
        "start": "2025-09-27"
    },
    "created": "2025-09-27T20:35:29Z",
    "contributor": [
        {
            "reference": "Practitioner/practitioner-1",
            "display": "Dr Ronald Bone"
        }
    ],
    "addresses": [
        {
            "reference": "Condition/condition-duodenal-ulcer",
            "display": "Condition Duodenal Ulcer"
        }
    ]
}